# Напишите программу, которая делит одно число на другое, запрашиваемое у пользователя. Обработайте возможную ошибку деления на ноль и выведите сообщение об ошибке при необходимости.
# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
# try:
#     print(a/b)
# except ZeroDivisionError:
    # print('Не делиться на ноль')
# Напишите программу, которая просит пользователя ввести свое имя. Если пользователь вводит пустую строку, выведите сообщение об ошибке.
# a = input('введите своё имя: ')
# if a == "":
#     print("Введите своё имя поле пустое!")
# Напишите программу, которая просит пользователя ввести пароль. Если пользователь вводит слишком короткий пароль (например, менее 8 символов), выведите сообщение об ошибке.
# a = input("Введите пароль: ")
# if len(a)<= 8 :
#     print("Ошибка , введите длинный пароль больше 8")
# else:
#     print(a)
# Напишите программу, которая запрашивает у пользователя два числа и выводит их сумму. Обработайте возможную ошибку при вводе некорректных значений.
# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
# c = a , b 
# print(sum(c))
# Напишите функцию, которая принимает произвольное количество аргументов и выводит их сумму.
# a = [23,12,1212,4]
# def sums(a):
#     b= sum(a)
#     print(b)
    
# sums(a)
# Доп задание
# Напишите функцию, которая принимает произвольное количество строковых аргументов и объединяет их в одну строку, разделенную запятой.

# a = int(input("Введите 1 число: "))
# b = int(input("Введите 2 число: "))
# c = int(input("Введите 3 число: "))
# d = int(input("Введите 4 число: "))
# e = a , b , c , d
# print(e)